// 2) ++m>--n

#include <iostream>
#include <cmath>
using namespace std;

int main(){

        int m, n;
        m = 25;
        n = 8;
        ++m;
        --n;
//  ++m>--n = означає що значення M збільшене на 1, має бути більшим за значення N зменшене на 1
            
            // Використовую оператор if, з умовою (m > n), якщо рівність справджується, то виводить cout нижче.
            if (m > n){
            cout << "Знайчення виразу m > за значення виразу n! " << (m > n) << endl; 
             
             // Використовую оператор if else, з умовою (m < n), за умови , якщо умова вище несправджується, і виводить cout нижче.
             
                } else if (m < n) {
            cout << "Знайчення виразу m < за значення виразу n! " << (m < n) << endl;
               
               // Використовую вдруге оператор if else, з умовою (m = n), за умови , якщо обидві умови вище несправджуються, і виводить cout нижче.

                } else if (m == n) {
            cout << "Знайчення виразу m = значення виразу n! " << (m = n) << endl;
            }
            
            
            
            return 0;
            }
            



    
